# -*- coding: utf-8 -*-
from random import choice


def get_new_cluster_name() -> str:
    items = [
        '火鸡', '高鸟', '猎犬', '兔叽', '猪猪', '蝴蝶', '鼹鼠', '海象', '鱼人', '龙蝇', '鹿鸭', '蚁狮', '熊獾', '巨鹿',
        '蛤蟆', '螃蟹', '蝾螈', '查理', '战车', '主教', '骑士', '蝙蝠', '乌鸦', '红雀', '雪雀', '鹦鹉', '浣猫', '兔子',
        '天体', '青蛙', '疯猪', '企欧', '雪兔', '电羊', '红象', '冬象', '触手', '座狼', '钢羊', '月蛾', '果蝇', '蜜蜂',
        '蜂后', '幽灵', '蚊子', '海草', '鲨鱼', '树精', '哈奇', '阿比', '伯尼', '猴子', '蜗牛', '石虾', '尘蛾', '犀牛',
        '树精', '鱿鱼', '龙虾', '鲸鱼', '克眼', '魔眼', '哨兵', '黑猪', '亮茄', '月鹿', '月熊', '月狼', '虚影', '霜鳄'
    ]
    return f'一拳一个小{choice(items)}'
